tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "aws/tap"
tap "instrumenta/instrumenta"
tap "cuelang/tap"
tap "tilt-dev/tap"
tap "cirruslabs/cli"
tap "goreleaser/tap"

brew "aws-okta"
brew "chamber"
brew "ctop"
brew "doctl"
brew "cirrus"
brew "drone-cli"
brew "gnupg"
brew "git"
brew "git-lfs"
brew "git-crypt"
brew "gnu-getopt"
brew "readline"
brew "jq"
brew "kubectx"
brew "make"
brew "pass"
brew "pass-otp"
brew "powerline-go"
brew "rsync"
brew "socat"
brew "tmux"
brew "vim"
brew "newman"
brew "gh"
brew "yaegi"
brew "kubeval"
brew "conftest"
brew "just"
brew "cue"
brew "dhall-json"
brew "tilt"
brew "screen"
brew "irssi"
brew "weechat"
brew "sops"
brew "goreleaser"
brew "python"
brew "stern"
brew "nfpm"
brew "yubico-piv-tool"
brew "ykman"
brew "bat"
brew "git-delta"
brew "gron"
brew "envconsul"

if OS.mac?
  cask "aws-vault"
  cask "1password"
  cask "keeper-password-manager"
  cask "chromedriver"
  cask "docker"
  cask "google-chrome"
  cask "iterm2"
  cask "skitch"
  cask "superduper"
  cask "session-manager-plugin"
  cask "postman"
  cask "font-juliamono"
  cask "jetbrains-toolbox"
  cask "oracle-jdk"
  cask "balenaetcher"
  cask "tunnelblick"
  brew "htop"
else
  brew "aws-vault"
end
