tap "aws/tap"
tap "cuelang/tap"
tap "defn/tap"
tap "borkdude/brew"

brew "chamber"
brew "gnupg"
brew "git"
brew "git-crypt"
brew "gnu-getopt"
brew "readline"
brew "jq"
brew "make"
brew "pass"
brew "pass-otp"
brew "powerline-go"
brew "rsync"
brew "socat"
brew "tmux"
brew "vim"
brew "gh"
brew "cue"
brew "screen"
brew "irssi"
brew "sops"
brew "stern"
brew "yubico-piv-tool"
brew "gron"
brew "step"
brew "hello"
brew "direnv"
brew "rg"

if OS.mac?
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"

  cask "aws-vault"
  cask "1password"
  cask "keeper-password-manager"
  cask "chromedriver"
  cask "google-chrome"
  cask "iterm2"
  cask "skitch"
  cask "superduper"
  cask "session-manager-plugin"
  cask "postman"
  cask "font-juliamono"
  cask "oracle-jdk"
  cask "balenaetcher"
  cask "lens"
  cask "divvy"
  cask "snagit"
  cask "dbeaver-community"
  cask "visual-studio-code"

  brew "htop"
  brew "pinentry-mac"
  brew "awscli"
else
  brew "aws-vault"
end
