tap "aws/tap"
tap "instrumenta/instrumenta"
tap "cuelang/tap"
tap "goreleaser/tap"
tap "versent/homebrew-taps"
tap "defn/tap"

brew "chamber"
brew "doctl"
brew "drone-cli"
brew "gnupg"
brew "git"
brew "git-crypt"
brew "gnu-getopt"
brew "readline"
brew "jq"
brew "make"
brew "pass"
brew "pass-otp"
brew "powerline-go"
brew "rsync"
brew "socat"
brew "tmux"
brew "vim"
brew "newman"
brew "gh"
brew "yaegi"
brew "kubeval"
brew "conftest"
brew "cue"
brew "screen"
brew "irssi"
brew "sops"
brew "goreleaser"
brew "stern"
brew "yubico-piv-tool"
brew "bat"
brew "git-delta"
brew "gron"
brew "envconsul"
brew "step"
brew "protobuf"
brew "figlet"
brew "lolcat"
brew "hello"
brew "saml2aws"
brew "glooctl"
brew "z"
brew "direnv"
brew "pulumi"
brew "bitwarden-cli"
brew "rg"
brew "pyenv"
brew "k9s"
brew "kubeseal"
brew "kubectx"

if OS.mac?
  tap "homebrew/cask"
  tap "homebrew/cask-fonts"
  tap "cloudflare/cloudflare"

  cask "aws-vault"
  cask "1password"
  cask "keeper-password-manager"
  cask "chromedriver"
  cask "docker"
  cask "google-chrome"
  cask "iterm2"
  cask "skitch"
  cask "superduper"
  cask "session-manager-plugin"
  cask "postman"
  cask "font-juliamono"
  cask "jetbrains-toolbox"
  cask "oracle-jdk"
  cask "balenaetcher"
  cask "tunnelblick"
  cask "lens"
  cask "divvy"

  brew "htop"
  brew "pinentry-mac"
  brew "cloudflared"
  brew "terminal-notifier"
  brew "awscli"
else
  brew "aws-vault"
end
